# <<を使うと配列の最後に要素を追加できる
a = []
a << 1
a << 2
a << 3
puts a

puts '---------------------------'

# 2番目の要素を削除
b = [1, 2, 3]
b.delete_at(1)
puts b

puts '---------------------------'

# 配列を使って多重代入
c, d = 1, 2
puts c
puts d

# 右辺の数が足りない場合nilが入る
e, f = [10]
puts e
puts f

puts '---------------------------'

# 右辺の数が多い場合はハミ出した値が切り捨て
g, h = [100, 200, 300]
puts g
puts h

puts '---------------------------'


# 配列の商と余りを配列として返すdivmodメソッド
puts 14.divmod(3)

puts '---------------------------'


# 配列の要素を削除
num1 = [1, 2, 3, 1, 2, 3]
# 配列から2の要素を削除
num1.delete(2)
p num1

puts '---------------------------'


# 奇数だけを削除するコード
num2 = [1, 2, 3, 1, 2, 3]
num2.delete_if do |n|
  n.odd?
end
p num2

puts '---------------------------'


# 偶数のみ値を10倍にしてから加算するコード
num3 = [1, 2, 3, 4]
sum = 0
num3 .each do |n|
  sum_value = n.even? ? n * 10 : n # 条件演算子
  sum += sum_value
end

p sum